# More Practice With SQL Queries - Lab

## Introduction

In this lesson, we'll run through some practice questions to refresh our knowledge of SQL Queries!

## Objectives

You will be able to:

- Practice your SQL knowledge

## Getting Started

As in previous labs, we'll make use of the `sqlite3` library as well as `pandas`. By combining them, we'll be able to write our queries as python strings, and make sure that the results are always returned as a pandas DataFrame. 

We'll start by loading both libraries and connecting to the database we'll be using for this lab, `data.sqlite`. You may remember this database from a previous lab. As a refresher, here's the ERD diagram for this database: 

<img src='images/Database-Schema.png'>

In the cell below:

* Import the necessary libraries `pandas` and `sqlite3`
* Establish a connection to the database `data.sqlite`
* Get the `cursor` from the connection and store it in the variable `c`.

In [6]:
import sqlite3
import pandas as pd 

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Basic Queries

Now, let's review basic SQL queries. In the cell below:

* Write a query that gets the first name, last name, phone number, address, and credit limit for all customers in California with a credit limit greater than 25000.00.

In [13]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you

c.execute("""select contactfirstname, contactlastname, 
                    phone, addressline1, addressline2, creditlimit 
                    from customers where creditlimit > 25000 and state = 'CA'""")

df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,contactFirstName,contactLastName,phone,addressLine1,addressLine2,creditLimit
0,Susan,Nelson,4155551450,5677 Strong St.,,210500.0
1,Julie,Murphy,6505555787,5557 North Pendale Street,,64600.0
2,Juri,Hashimoto,6505556809,9408 Furth Circle,,84600.0
3,Julie,Young,6265557265,78934 Hillside Dr.,,90700.0
4,Valarie,Thompson,7605558146,361 Furth Circle,,105000.0
5,Julie,Brown,6505551386,7734 Strong St.,,105000.0
6,Brian,Chandler,2155554369,6047 Douglas Av.,,57700.0
7,Sue,Frick,4085553659,3086 Ingle Ln.,,77600.0
8,Steve,Thompson,3105553722,3675 Furth Circle,,55400.0
9,Sue,Taylor,4155554312,2793 Furth Circle,,60300.0

#### Expected Output

<img src='images/expected-output-1.png'>

## Aggregate Functions and GROUP BY

Next, write a query that get sthe average credit limit per state.

In [18]:
c.execute('''select state, avg(creditlimit) from customers group by 1''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

            state  avg(creditlimit)
0                      61839.726027
1              BC      89950.000000
2              CA      83854.545455
3              CT      57350.000000
4        Co. Cork          0.000000
5   Isle of Wight      93900.000000
6              MA      70755.555556
7              NH     114200.000000
8              NJ      43000.000000
9             NSW     100550.000000
10             NV      71800.000000
11             NY      89966.666667
12          Osaka      81200.000000
13             PA      84766.666667
14       Pretoria          0.000000
15     Queensland      51600.000000
16         Québec      48700.000000
17          Tokyo      94400.000000
18       Victoria      88800.000000

#### Expected Output

<img src='images/expected-output-2.png'>

## JOINs

Now, write a query that uses JOIN statements to get the customer name, customer number, order number, status, and quantity ordered. Print only the head of this DataFrame.

In [22]:
c.execute('''select customerName, customerNumber, orderNumber, status, quantityOrdered
                    from customers join orders using(customerNumber)
                    join orderdetails using(orderNumber) order by 1''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

     customerName  customerNumber orderNumber   status quantityOrdered
0  AV Stores, Co.             187       10110  Shipped              20
1  AV Stores, Co.             187       10110  Shipped              27
2  AV Stores, Co.             187       10110  Shipped              28
3  AV Stores, Co.             187       10110  Shipped              29
4  AV Stores, Co.             187       10110  Shipped              31

#### Expected Output

<img src='images/expected-output-3.png'>

## HAVING and ORDER BY

Now, return the customerName, customrerNumber, productName, productCode and total number ordered for any product a customer has bought 10 or more of cumulatively. Sort the rows in descending order by the quantity ordered. 

**_Hint_**: For this one, you'll need to make use of HAVING, GROUP BY, and ORDER BY--make sure you get the order of them correct!

In [25]:
c.execute('''select customerName, customerNumber, productName, productCode, quantityOrdered
                    from customers join orders using(customerNumber)
                    join orderdetails using(orderNumber)
                    join products using(productCode) 
                    group by 1 
                    having count(distinct productCode) >= 10
                    order by quantityOrdered desc''').fetchall()

[('Mini Caravy', 209, '1956 Porsche 356A Coupe', 'S24_3856', '76'),
 ('Salzburg Collectables', 382, '1956 Porsche 356A Coupe', 'S24_3856', '70'),
 ('Danish Wholesale Imports',
  145,
  '1948 Porsche Type 356 Roadster',
  'S18_3685',
  '65'),
 ('Handji Gifts& Co', 166, '1939 Chevrolet Deluxe Coupe', 'S24_1937', '61'),
 ('Auto Canal+ Petit', 406, '1960 BSA Gold Star DBD34', 'S24_2000', '59'),
 ('Gift Depot Inc.', 175, '1962 City of Detroit Streetcar', 'S50_1514', '51'),
 ('Daedalus Designs Imports', 171, '2002 Yamaha YZR M1', 'S50_4713', '50'),
 ('FunGiftIdeas.com', 462, 'ATA: B757-300', 'S700_2834', '50'),
 ('GiftsForHim.com', 357, '1936 Chrysler Airflow', 'S24_4258', '50'),
 ('Norway Gifts By Mail, Co.',
  299,
  '1956 Porsche 356A Coupe',
  'S24_3856',
  '50'),
 ('Suominen Souveniers', 334, '1997 BMW F650 ST', 'S32_1374', '50'),
 ('Technics Stores Inc.', 161, '1997 BMW R 1100 S', 'S24_1578', '50'),
 ('CAF Imports', 344, '1969 Ford Falcon', 'S12_3891', '49'),
 ('Corporate Gift Ideas Co.', 321, 'The Mayflower', 'S700_1938', '49'),
 ('Scandinavian Gift Ideas',
  448,
  '1960 BSA Gold Star DBD34',
  'S24_2000',
  '49'),
 ('Collectable Mini Designs Co.',
  239,
  '2002 Chevy Corvette',
  'S24_3432',
  '48'),
 ('Down Under Souveniers, Inc',
  323,
  '1961 Chevrolet Impala',
  'S24_4620',
  '48'),
 ('Marseille Mini Autos', 350, '1982 Ducati 996 R', 'S32_2206', '48'),
 ("Men 'R' US Retailers, Ltd.", 347, 'Boeing X-32A JSF', 'S72_1253', '48'),
 ('Blauer See Auto, Co.', 128, '1940s Ford truck', 'S18_4600', '47'),
 ('Gifts4AllAges.com', 362, 'Pont Yacht', 'S72_3212', '47'),
 ('Australian Gift Network, Co',
  333,
  '1928 British Royal Navy Airplane',
  'S24_1785',
  '46'),
 ('Euro+ Shopping Channel', 141, '1982 Camaro Z28', 'S700_2824', '46'),
 ("La Corne D'abondance, Co.", 172, '1982 Camaro Z28', 'S700_2824', '46'),
 ('Australian Collectors, Co.', 114, '1940s Ford truck', 'S18_4600', '45'),
 ('Herkku Gifts',
  167,
  '1938 Cadillac V-16 Presidential Limousine',
  'S24_2022',
  '45'),
 ('Lyon Souveniers', 250, '1962 City of Detroit Streetcar', 'S50_1514', '45'),
 ('Microscale Inc.', 456, '2002 Yamaha YZR M1', 'S50_4713', '45'),
 ('Online Mini Collectables', 204, 'The Queen Mary', 'S700_3962', '45'),
 ('Baane Mini Imports',
  121,
  '1962 City of Detroit Streetcar',
  'S50_1514',
  '44'),
 ('Dragon Souveniers, Ltd.', 148, '1997 BMW F650 ST', 'S32_1374', '44'),
 ('Land of Toys Inc.', 131, 'Boeing X-32A JSF', 'S72_1253', '44'),
 ('Mini Creations Ltd.', 320, '2002 Yamaha YZR M1', 'S50_4713', '44'),
 ('Super Scale Inc.', 455, '1982 Camaro Z28', 'S700_2824', '44'),
 ('Gift Ideas Corp.', 447, 'F/A 18 Hornet 1/72', 'S700_3167', '43'),
 ("L'ordine Souveniers", 386, 'American Airlines: MD-11S', 'S700_4002', '43'),
 ('The Sharp Gifts Warehouse', 450, '2002 Chevy Corvette', 'S24_3432', '43'),
 ('Australian Collectables, Ltd', 471, 'Boeing X-32A JSF', 'S72_1253', '42'),
 ('Classic Legends Inc.', 424, 'Pont Yacht', 'S72_3212', '42'),
 ('Cruz & Sons Co.', 385, '1982 Ducati 900 Monster', 'S24_2360', '42'),
 ("Marta's Replicas Co.",
  286,
  'Diamond T620 Semi-Skirted Tanker',
  'S50_1392',
  '42'),
 ('Volvo Model Replicas, Co',
  144,
  '1962 Volkswagen Microbus',
  'S24_2300',
  '42'),
 ('AV Stores, Co.', 187, '1936 Mercedes Benz 500k Roadster', 'S24_3969', '41'),
 ('Auto Associés & Cie.', 256, '1982 Camaro Z28', 'S700_2824', '40'),
 ('Collectables For Less Inc.',
  379,
  '1936 Chrysler Airflow',
  'S24_4258',
  '40'),
 ('Extreme Desk Decorations, Ltd',
  412,
  '2002 Yamaha YZR M1',
  'S50_4713',
  '40'),
 ('Mini Gifts Distributors Ltd.',
  124,
  '1938 Cadillac V-16 Presidential Limousine',
  'S24_2022',
  '40'),
 ('Tekni Collectables Inc.',
  328,
  'American Airlines: MD-11S',
  'S700_4002',
  '40'),
 ('Vida Sport, Ltd', 298, '1961 Chevrolet Impala', 'S24_4620', '40'),
 ('King Kong Collectables, Co.', 211, 'ATA: B757-300', 'S700_2834', '39'),
 ('Mini Classics', 319, 'American Airlines: MD-11S', 'S700_4002', '39'),
 ('Rovelli Gifts', 278, 'American Airlines: MD-11S', 'S700_4002', '39'),
 ('Toys of Finland, Co.',
  186,
  '1992 Ferrari 360 Spider red',
  'S18_3232',
  '39'),
 ('West Coast Collectables Co.',
  475,
  '1936 Chrysler Airflow',
  'S24_4258',
  '39'),
 ('Osaka Souveniers Co.',
  177,
  '1948 Porsche Type 356 Roadster',
  'S18_3685',
  '37'),
 ('Mini Auto Werke', 452, '1917 Maxwell Touring Car', 'S18_3320', '36'),
 ('Toms Spezialitäten, Ltd', 259, '1982 Ducati 996 R', 'S32_2206', '36'),
 ('Toys4GrownUps.com', 205, '1982 Lamborghini Diablo', 'S24_2972', '36'),
 ('Clover Collections, Co.', 189, 'ATA: B757-300', 'S700_2834', '35'),
 ('Signal Collectibles Ltd.',
  487,
  '1954 Greyhound Scenicruiser',
  'S32_2509',
  '35'),
 ('Alpha Cognac', 242, 'Pont Yacht', 'S72_3212', '34'),
 ('Classic Gift Ideas, Inc', 339, 'Boeing X-32A JSF', 'S72_1253', '34'),
 ('Québec Home Shopping Network', 233, '1982 Camaro Z28', 'S700_2824', '34'),
 ('Reims Collectables', 353, 'Boeing X-32A JSF', 'S72_1253', '34'),
 ('Stylish Desk Decors, Co.',
  324,
  'Corsair F4U ( Bird Cage)',
  'S24_3949',
  '34'),
 ('Vitachrome Inc.', 181, '1982 Camaro Z28', 'S700_2824', '34'),
 ('giftsbymail.co.uk', 240, 'Boeing X-32A JSF', 'S72_1253', '34'),
 ('Diecast Collectables',
  495,
  '1939 Chevrolet Deluxe Coupe',
  'S24_1937',
  '33'),
 ('Mini Wheels Co.',
  129,
  '1996 Peterbilt 379 Stake Bed with Outrigger',
  'S32_3522',
  '33'),
 ('Muscle Machine Inc', 151, '1954 Greyhound Scenicruiser', 'S32_2509', '33'),
 ('Royal Canadian Collectables, Ltd.', 260, 'Pont Yacht', 'S72_3212', '33'),
 ('Amica Models & Co.', 249, 'Pont Yacht', 'S72_3212', '32'),
 ('Cambridge Collectables Co.', 173, 'Boeing X-32A JSF', 'S72_1253', '32'),
 ('Corrida Auto Replicas, Ltd', 458, '1982 Camaro Z28', 'S700_2824', '32'),
 ("Kelly's Gift Shop", 496, '1997 BMW F650 ST', 'S32_1374', '32'),
 ('UK Collectables, Ltd.', 201, '2002 Yamaha YZR M1', 'S50_4713', '31'),
 ('Canadian Gift Exchange Network', 202, '1982 Camaro Z28', 'S700_2824', '30'),
 ('Online Diecast Creations Co.',
  363,
  '1938 Cadillac V-16 Presidential Limousine',
  'S24_2022',
  '30'),
 ('Enaco Distributors', 216, 'ATA: B757-300', 'S700_2834', '29'),
 ('Oulu Toy Supplies, Inc.', 311, 'Pont Yacht', 'S72_3212', '29'),
 ('Petit Auto', 314, '1936 Chrysler Airflow', 'S24_4258', '28'),
 ('Double Decker Gift Stores, Ltd',
  489,
  '1952 Citroen-15CV',
  'S24_2887',
  '27'),
 ('Saveley & Henriot, Co.',
  146,
  '1936 Mercedes Benz 500k Roadster',
  'S24_3969',
  '27'),
 ('Diecast Classics Inc.',
  157,
  '1936 Mercedes-Benz 500K Special Roadster',
  'S18_1367',
  '25'),
 ("Anna's Decorations, Ltd",
  276,
  '1938 Cadillac V-16 Presidential Limousine',
  'S24_2022',
  '24'),
 ('Iberia Gift Imports, Corp.',
  484,
  '1936 Mercedes Benz 500k Roadster',
  'S24_3969',
  '24'),
 ('Heintze Collectables', 227, 'The Mayflower', 'S700_1938', '23'),
 ('Signal Gift Stores',
  112,
  '1936 Mercedes Benz 500k Roadster',
  'S24_3969',
  '22'),
 ('Bavarian Collectables Imports, Co.',
  415,
  'Boeing X-32A JSF',
  'S72_1253',
  '21'),
 ('Motor Mint Distributors Inc.', 486, '2002 Yamaha YZR M1', 'S50_4713', '20'),
 ('La Rochelle Gifts',
  119,
  'Diamond T620 Semi-Skirted Tanker',
  'S50_1392',
  '18'),
 ('Souveniers And Things Co.',
  282,
  '1936 Mercedes Benz 500k Roadster',
  'S24_3969',
  '15'),
 ('Tokyo Collectables, Ltd',
  398,
  '1936 Mercedes Benz 500k Roadster',
  'S24_3969',
  '15')]

#### Expected Output

<img src='images/expected-output-4.png'>

## Subqueries

Finally, get the first name, last name, employee number, and office code for employees from an office with less than 5 employees.

#### Expected Output

<img src='images/expected-output-5.png'>

# Summary

In this lesson, we reviewed all the major concepts and keywords associated with SQL queries!